tests/dropletRelaxation3D/src/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.phase1 1
);

regions
(
//     boxToCell
//     {
//         box (-20 -20 -20) (20 20 20); 
//         fieldValues
//         (
//             volScalarFieldValue alpha.phase1 0
//         );
//     }

    sphereToCell
    {
        centre (0 0 0);
        radius 2.5;
        fieldValues
        (
            volScalarFieldValue alpha.phase1 0
        );
    }
);


// ************************************************************************* //
