tests/dropletRelaxation3D/src/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



// Which of the steps to run
castellatedMesh true;
snap            false;
addLayers       false;

geometry
{
    refineCylinder1
    {
        type            searchableCylinder;
        point1          (0 -1e6 0);
        point2          (0 1e6 0);
        radius          0.5;
    }
//     refineCylinder2
//     {
//         type            searchableCylinder;
//         point1          (0 0 0);
//         point2          (0 0 0.25);
//         radius          1.0;
//     }
};

// Settings for the castellatedMesh generation.
castellatedMeshControls
{
    maxLocalCells 400000;
    maxGlobalCells 4000000;
    minRefinementCells 0;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 2;

    features
    (
    );

    refinementSurfaces
    {
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        refineCylinder1
        {
          mode      distance;
          levels    ((0.1 2));
        }
//         refineCylinder2
//         {
//             mode inside;
//             levels ((1E15 3));
//         }
    }

    // Mesh selection
    // ~~~~~~~~~~~~~~
    locationInMesh (0 1e-2 1e-2);

    allowFreeStandingZoneFaces true;
}



// Settings for the snapping.
snapControls
{
    nSmoothPatch                3;
    tolerance                   1.0;
    nSolveIter                  300;
    nRelaxIter                  5;
}



// Settings for the layer addition.
addLayersControls
{
    relativeSizes               true;

    layers
    {
    }
    
    expansionRatio              1.0;
    finalLayerThickness         0.3;
    minThickness                0.25;
    nGrow                       0;
    
    featureAngle                30;
    nRelaxIter                  5;
    nSmoothSurfaceNormals       1;
    nSmoothNormals              3;
    nSmoothThickness            10;
    maxFaceThicknessRatio       0.5;
    maxThicknessToMedialRatio   0.3;
    minMedianAxisAngle          90;
    nBufferCellsNoExtrude       0;

    nLayerIter                  50;
    nRelaxedIter                20;
}



// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    maxNonOrtho                 120;
    maxBoundarySkewness         20;
    maxInternalSkewness         6;
    maxConcave                  100;
    minVol                      -1e-30;
    minTetQuality               1e-30;
    minArea                     0;
    minTwist                    0.05;
    minDeterminant              0.01;
    minFaceWeight               0.05;
    minVolRatio                 0.01;
    minTriangleTwist            -1;
    minVolCollapseRatio         0.5;

    // Advanced
    nSmoothScale                4;
    errorReduction              0.75;
    relaxed
    {
        maxNonOrtho             75;
    }
}

writeFlags
(
    scalarLevels
//     layerSets
//     layerFields
);

// Advanced
mergeTolerance                  1e-6;

debug 0;

// ************************************************************************* //
